Repository: AbhinJ/workshop
Catalog: docs/i18n/*/LC_MESSAGES/chapters/topology.po
Languages: es

source: Create a Network Topology
es: Crear una topología de red

source: :doc:`osm2pgrouting <osm2pgrouting>` is a convenient tool, but it's also a *black box*. There are several cases where :doc:`osm2pgrouting <osm2pgrouting>` can't be used. Obviously if the data isn't OpenStreetMap data. Some network data already comes with a network topology that can be used with pgRouting out-of-the-box. Often network data is stored in Shape file format (``.shp``) and we can use PostGIS' ``shape2postgresql`` converter to import the data into a PostgreSQL database. But what to do then?
es: :doc:`osm2pgrouting <osm2pgrouting>` es una herramienta conveniente, pero también es un *caja negra*. Hay varios casos donde :doc:`osm2pgrouting <osm2pgrouting>` no se puede utilizar. Obviamente si los datos no son datos de OpenStreetMap. Algunos datos de la red ya viene con una topología de red que puede ser utilizada con pgRouting out-of-the-box. A menudo, los datos de la red se almacenadas en en formato de archivo Shape (``.shp``) y podemos usar el convertidor `shape2postgresql`` de PostGIS para importar los datos en una base de datos PostgreSQL. Pero ¿qué hacer entonces?

source: In this chapter you will learn how to create a network topology from scratch. For that we will start with data that contains the minimum attributes needed for routing and show how to proceed step-by-step to build routable data for pgRouting.
es: En este capítulo aprenderás cómo crear una topología de red desde cero. Por eso comenzaremos con los datos que contienen los atributos mínimos necesarios para el enrutamiento y mostrar cómo proceder paso a paso para construir datos enrutables para pgRouting.

source: Load network data
es: Cargar los datos de la red

source: At first we will load a database dump from the workshop ``data`` directory. This directory contains a compressed file with database dumps as well as a small size network data. If you haven't uncompressed the data yet, extract the file by
es: Al principio vamos a cargar la información de la base de datos del contenida en el directorio del taller: ``data`` . Este directorio contiene un archivo comprimido con el dump de la base de datos, así como una pequeña red de datos. Si todavía no has descomprimido los datos, entonces extraer el archivo por

source: The following command will import the database dump. It will add PostGIS and pgRouting functions to a database, in the same way as decribed in the previous chapter. It will also load the sample data with a minimum number of attributes, which you will usually find in any network data:
es: El siguiente comando va a importar el dump de la base de datos. Agregará las funciones de PostGIS y pgRouting a una base de datos, en la forma descrita en el capítulo anterior. También carga los datos de muestra con un número mínimo de atributos, que generalmente se encuentra en los datos de red:

source: Let's see wich tables have been created:
es: Veamos las tablas que se han creado:

source: Run: ``psql -U postgres -d pgrouting-workshop -c "\d"``
es: Ejecutar: ``psql -U postgres -d pgrouting-workshop -c "\d"``

source: The table containing the road network data has the name ``ways``. It consists of the following attributes:
es: La tabla que contiene los datos de la red carretera tiene el nombre ``ways``. Consta de los siguientes atributos:

source: Run: ``psql -U postgres -d pgrouting-workshop -c "\d ways"``
es: Ejecutar: ``psql -U postgres -d pgrouting-workshop -c "\d ways"``

source: It is common that road network data provides at least the following information:
es: Es común que datos de la red carretera proporcionen al menos la siguiente información:

source: Road link ID (gid)
es: ID del Camino (gid)

source: Road class (class_id)
es: Clase de camino (class_id)

source: Road link length (length)
es: Longitud del camino (length)

source: Road name (name)
es: Nombre del camino (name)

source: Road geometry (the_geom)
es: Geometría del camino (the_geom)

source: This allows to display the road network as a PostGIS layer in GIS software, for example in QGIS. Though it is not sufficient for routing, because it doesn't contain network topology information.
es: Esto permite para visualizar la red de carreteras como una capa PostGIS en software GIS, por ejemplo en QGIS. Aunque no es suficiente para el enrutamiento, porque no contiene información de la topología de red.

source: For the next steps we need to start the PostgreSQL command line tool
es: Para los próximos pasos que necesitamos iniciar la herramienta de línea de comandos de PostgreSQL

source: ... or use PgAdmin III.
es: ... o utilizar PgAdmin III.

source: Calculate topology
es: Calcular la topología

source: Having your data imported into a PostgreSQL database usually requires one more step for pgRouting. You have to make sure that your data provides a correct network topology, which consists of information about source and target ID of each road link.
es: Tener sus datos importados en una base de datos PostgreSQL generalmente requiere un paso más para pgRouting. Tienes que asegurarse de que sus datos proporcionan una topología de red correcta, que consiste en obtener más información sobre el ID del origen y destino de cada enlace.

source: If your network data doesn't have such network topology information already you need to run the ``pgr_createTopology`` function. This function assigns a ``source`` and a ``target`` ID to each link and it can "snap" nearby vertices within a certain tolerance.
es: Si los datos de la red no tienen tal información de la topología de red se tiene que ejecutar la función de ``pgr_createTopology``. Esta función asigna un id tanto al ``source`` como al ``target`` para cada enlace y puede ajustar lo "cercano" de los vértices dentro de una cierta tolerancia.

source: First we have to add source and target column, then we run the ``pgr_createTopology`` function ... and wait. Depending on the network size this process may take from minutes to hours. It will also require enough memory (RAM or SWAP partition) to store temporary data.
es: Primero tenemos que añadir las columnas de origen y de destino, entonces ejecutamos la función `pgr_createTopology`` ... y esperamos. Dependiendo del tamaño de la red, este proceso puede tardar desde minutos a horas. También será necesario suficiente memoria (RAM o partición SWAP) para almacenar datos temporales.

source: Execute ``psql -U postgres -d pgrouting-workshop`` in your terminal to connect to the database and start the PostgreSQL shell. Leave the shell with ``\q`` command.
es: Ejecutar ``psql -U postgres -d pgrouting-workshop`` en su terminal para conectarse a la base de datos y empezar el shell de PostgreSQL. Salir del shell con el comando ``\q`` .

source: The dimension of the tolerance parameter depends on your data projection. Usually it's either "degrees" or "meters".
es: La dimensión del parámetro tolerancia depende de la proyección de datos. Suele ser "grados" o "metros".

source: Add indices
es: Agregar Indices

source: Fortunately we didn't need to wait too long because the data is small. But your network data might be very large, so it's a good idea to add an index to ``source`` and ``target`` column.
es: Afortunadamente no tenemos que esperar mucho tiempo porque los datos son pocos. Pero los datos de la red pueden ser muy grandes, así que es una buena idea añadir un índice a la columnas ``source`` y``target`` .

source: After these steps our routing database looks like this:
es: Después de estos pasos nuestra base de datos de enrutamiento se ve así:

source: Run: ``\d``
es: Ejecutar: ``\d``

source: ``geography_columns`` should contain a record for each table with "geometry" attribute and its SRID.
es: ``geography_columns`` debe contener un registro para cada tabla con atributo "geometría" y su SRID.

source: ``vertices_tmp`` contains a list of all network nodes.
es: `vertices_tmp`` contiene una lista de todos los nodos de la red.

source: Run: ``\d ways``
es: Ejecutar: ``\d ways``

source: ``source`` and ``target`` columns are now updated with node IDs.
es: Columnas de ``source`` y ``target`` ahora se actualizan con los ID de los nodos.

source: ``name`` may contain the street name or be empty.
es: ``name`` puede contener el nombre de la calle o estar vacío.

source: ``length`` is the road link length in kilometers.
es: ``length`` es la longitud del enlace de carretera en kilómetros.

source: Now we are ready for our first routing query with :doc:`Dijkstra algorithm <shortest_path>`!
es: Ahora estamos listos para nuestra primera consulta enrutamiento con :doc:`Dijkstra algorithm <shortest_path>`!
